2023_april.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>April 2023</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="simple.css" />
</head>
<body>
<div id="preamble" class="status">
<div style="position: fixed; top: 10px; right: 10px;">
         <button class="toggle-theme-btn" onclick="toggleDarkMode()">Light/Dark</button>
       </div>
</div>
<div id="content" class="content">
<h1 class="title">April 2023</h1>
<p>
<a href="./index.html">Home</a>
</p>

<p>
The current subjective state for the month of April, 2023. My second newsletter, or time capsule. Whatever you want to call it. Let's get started.
</p>

<hr />

<p>
I came across an interesting idea from Venkat Rao, who happens to generate a lot of interesting ideas. He said to consider thinking of the world as protocol first rather than people first. Yes, we have agency, but at every interface with a human or a machine, there are protocols, from handshakes to rituals on the human side, to http on the computer side. It's an interesting shift, where once you see it, it's hard to unsee. He's hosting a <a href="https://efdn.notion.site/Summer-of-Protocols-3d7983d922184c4eb72749e9cb60d076">Summer of Protocols</a> program to get more people to look into this. I missed the deadline to sign up, though I might do my own independent research accordingly.
</p>

<hr />

<p>
I learned about an interesting phrase: <a href="https://en.wikipedia.org/wiki/System_D">System D</a>. This is basically when you have to innovate and improvise in the most extreme circumstances. Anthony Bourdain has written about this. Specifically, from a <a href="https://www.denverpost.com/2006/05/26/the-nasty-bits-by-anthony-bourdain/">Denver Post review of his book The Nasty Bits</a>:
</p>

<p>
"It’s when the orders are pouring in and the supplies are running low and the tempers are growing thin that one sees System D practiced at its highest level. Hot water heater explodes? No sweat. Just push the rillettes over and start boiling water, carnale. Run out of those nice square dinner plates for the lobster spring rolls? No problem. Dummy up a new presentation and serve on the round plates. We know what to do. Meat grinder broken? It’s steak tartare cut by hand, papi. Few things are more beautiful to me than a bunch of thuggish, heavily-tattooed line cooks moving around each other like ballerinas on a busy Saturday night. Seeing two guys who’d just as soon cut each other’s throats in their off hours moving in unison with grace and ease can be as uplifting as any chemical stimulant or organized religion."
</p>

<hr />

<p>
As a former academic researcher, who still does research, I was happy to learn that AI researcher Janus, whose output consists of blogs and tweets, has been cited in academic literature, in this <a href="https://arxiv.org/abs/2302.00805">Arxiv paper</a>, which also cites many other bloggers.
</p>

<hr />

<p>
I am a fan of first principles, and thus I am a fan of <a href="https://colab.research.google.com/drive/1SiF0KZJp75rUeetKOWqpsA8clmHP6jMg?usp=sharing">Andrej Karpathy's "baby GPT."</a> Its tokens are 0 or 1 with a context window of 3. It is trained on binary strings. It then outputs 3-bit binary strings. With all the work on ChatGPT-related tools right now (and there are plenty of other newsletters covering this), I think it's important to take a step back and get some fundamental insight from programming the simplest version of whatever it is that is trending.
</p>

<hr />

<p>
I am a fan of <a href="http://www.catb.org/~esr/faqs/hacker-howto.html">hacking</a>, in the sense of clever re-purposing of tools and/or problem solving. This is expressed often in terms of computers, but it is by no means limited to them. In particular, a good hack involves something that I have never thought of, where my mental model of some corner of the world completely falls out from under me.
</p>

<p>
So I was immediately fascinated by <a href="https://en.wikipedia.org/wiki/Dishwasher_salmon">dishwasher salmon</a>. The idea is that you can actually take raw salmon, wrap it in foil, place it into the dishwasher for a standard wash and dry cycle, and you have cooked salmon. There is a caveat here, explained in the article, that not every dishwasher heats its dishes at the same temperature and duration. So you would really have to test it with a meat thermometer to see if the salmon do indeed cook fully given the initial conditions. If it does, then you have a cooking process that is apparently odorless (as you can probably tell, I have yet to try this). What's more: apparently, you can wash dishes alongside your salmon if you package it tightly enough.
</p>

<hr />

<p>
We have been talking about post-truth for a while, especially in the context of AI, where it is often referred to as "deep fakes." Here is a pretty good expression of that, where scammers <a href="https://nypost.com/2023/04/12/ai-clones-teen-girls-voice-in-1m-kidnapping-scam/">cloned the voice of a teen girl</a>, and then tried to convince her mom that she had been kidnapped. They demanded a ransom of $1 million. One of the FBI agents on the case recommended asking a bunch of questions that voice cloners would not know. While this advice might seem obvious, it is still good to keep that as part of a checklist for all of your loved ones, as things like this may become more common as the AIs get better at what they do.
</p>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.1 (<a href="https://orgmode.org">Org</a> mode 9.5.2)</p>
</div>
</body>
</html>
